author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'airdrop_transfer_outbound'
details: 'TODO'
description: |
  This Unified Log filter may be used to report on outbound AirDrop file transfers from the Mac.
  This filter functions by monitoring logging from an AirDrop process spawning from a valid location and a logged string known to indicate an outbound file transfer was offered.
id: e2a24620-b033-4c20-84c8-78e5acc9e360
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
      subsystem: 'com.apple.sharing'
      process: 'AirDrop'
      processImagePath|startswith: '/System/Library'
      eventMessage|startswith: 'Successfully issued sandbox extension for'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa