author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'gatekeeper_file_access_scan_activity'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on Gatekeeper scanning activity when a file is opened.
    This filter functions by monitoring logging from the subsystem, process and category known to be used for log entries from this activity.

id: 24997043-58cb-4ebb-9066-a4544507ab76
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        subsystem: 'com.apple.syspolicy.exec'
        process: 'syspolicyd'
        category: 'default'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## gatekeeper_file_access_scan_activity
##
## This Unified Log filter may be used to report on Gatekeeper scanning activity when a file is opened.
## This filter functions by monitoring logging from the subsystem, process and category known to be used for log entries from this activity.
#
## Filter Predicate(s):
#
#subsystem == "com.apple.syspolicy.exec" AND process == "syspolicyd" AND category == "default"
#
## Example output:
#
#2021-XX-XX XX:XX:XX.679936+0000 XXXXXXX Default 0x0 368    0    syspolicyd: [com.apple.syspolicy.exec:default] GK performScan: PST: (path: /Applications/AppName.app), (team: (null)), (id: (null)), (bundle_id: (null))
#2021-XX-XX XX:XX:XX.168070+0000 XXXXXXX Default 0x0 368    0    syspolicyd: [com.apple.syspolicy.exec:default] GK evaluateScanResult: 0, PST: (path: /Applications/AppName.app), (team: XXXXXXXXXX), (id: com.company.domain), (bundle_id: com.app.domain), 1, 0, 1, 0, 4, 0
#2021-XX-XX XX:XX:XX.168323+0000 XXXXXXX Default 0x0 368    0    syspolicyd: [com.apple.syspolicy.exec:default] Prompt shown (5, 0), waiting for response: PST: (path: /Applications/AppName.app), (team: XXXXXXXXXX), (id: com.company.domain), (bundle_id: com.app.domain)
#2021-XX-XX XX:XX:XX.835865+0000 XXXXXXX Default 0x0 368    0    syspolicyd: [com.apple.syspolicy.exec:default] Code evaluation completed: 2
#2021-XX-XX XX:XX:XX.835947+0000 XXXXXXX Default 0x0 368    0    syspolicyd: [com.apple.syspolicy.exec:default] Allowing code due to user approval
#2021-XX-XX XX:XX:XX.887844+0000 XXXXXXX Default 0x0 368    0    syspolicyd: [com.apple.syspolicy.exec:default] Marked application as user approved: 1, PST: (path: /Applications/AppName.app), (team: XXXXXXXXXX), (id: com.company.domain), (bundle_id: com.app.domain)
#
## Additional Information:
#
#n/a
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#Yes
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.