author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'local_user_password_change_success'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on failed password changes for users on the system.
    This filter functions by monitoring logging from the opendirectoryd subsystem and process within the auth category and event message containing a string known to indicate a successful password change.

id: 70d7711c-c974-4da7-9ff5-ad1b437b34b3
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        subsystem: 'com.apple.opendirectoryd'
        process: 'opendirectoryd'
        category: 'auth'
        eventMessage|contains : 'Password changed for'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## local_user_password_change_success
##
## This Unified Log filter may be used to report on failed password changes for users on the system.
## This filter functions by monitoring logging from the opendirectoryd subsystem and process within the auth category and event message containing a string known to indicate a successful password change.
##
## Filter Predicate:
#
#subsystem == "com.apple.opendirectoryd" AND process == "opendirectoryd" AND category == "auth" AND eventMessage CONTAINS "Password changed for"
#
## Example output
#
#2021-XX-XX XX:44:50.723633+0100 XXXXXX     Default     XXXXXX               XXX    0    opendirectoryd: (PlistFile) [com.apple.opendirectoryd:auth] Password changed for username (user-UUID-here)
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.