author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'local_user_password_change_failure'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on failed password changes for users on the system.
    This filter functions by monitoring logging from the opendirectoryd subsystem and process within the auth category and event message containing a string known to indicate a failed password change.

id: 4d15de06-f335-4533-b9eb-ce3a623652d3
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        subsystem: 'com.apple.opendirectoryd'
        process: 'opendirectoryd'
        category: 'auth'
        eventMessage|contains : 'Failed to change password'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## local_user_password_change_failure
##
## This Unified Log filter may be used to report on failed password changes for users on the system.
## This filter functions by monitoring logging from the opendirectoryd subsystem and process within the auth category and event message containing a string known to indicate a failed password change.
##
## Filter Predicate:
#
#subsystem == "com.apple.opendirectoryd" AND process == "opendirectoryd" AND category == "auth" AND eventMessage CONTAINS "Failed to change password"
#
## Example output
#
#2021-XX-XX XX:44:50.723633+0100 XXXXXX     Default     XXXXXX               XXX    0    opendirectoryd: (PlistFile) [com.apple.opendirectoryd:auth] Failed to change password for user username (user-UUID-here): New password failed to meet policy