author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'lock_screen_unlock_failure'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on failed unlock attempts at the macOS lock screen.
    This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a failed unlock attempt.

id: c349ae1d-4707-4223-9204-a7a1542445bb
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        processImagePath|startswith: '/System/Library/CoreServices'
        process: 'loginwindow'
        eventMessage|contains: 'INCORRECT'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## lock_screen_unlock_failure
##
## This Unified Log filter may be used to report on failed unlock attempts at the macOS lock screen.
## This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a failed unlock attempt.
##
## Tested macOS Versions:
## - macOS 12
## - macOS 11
##
## Filter Predicate:
#
#processImagePath BEGINSWITH "/System/Library/CoreServices" AND process == "loginwindow" AND eventMessage CONTAINS[c] "INCORRECT"
#
## Example output:
#
#2022-XX-XX XX:XX:XX.233347-0800 XXXXXX Default XXX 1322 0 loginwindow: [com.apple.loginwindow.logging:Standard] -[LWDefaultScreenLockUI authFailWithMessage:] | enter. INCORRECT password
#
## Additional Information:
#
#Useful for identifying frequent failed screen unlock attempts.
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#No
#
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.