author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'login_through_login_window_with_password_failure'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on failed login attempts with a password at the macOS login window.
    This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a failed login attempt with the password.

id: 92794fb4-0b45-4c0a-9efb-e614a1e7e34b
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        processImagePath|starswith: '/System/'
        process: 'SecurityAgent'
        subsystem: 'com.apple.loginwindow'
        eventMessage|contains: 'Authentication failure'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## login_through_login_window_with_password_failure
##
## This Unified Log filter may be used to report on failed login attempts with a password at the macOS login window.
## This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a failed login attempt with the password.
##
## Tested macOS Versions:
## - macOS 12
##
## Filter Predicate:
#
#processImagePath BEGINSWITH "/System/" AND process == "SecurityAgent" AND subsystem == "com.apple.loginwindow" AND eventMessage CONTAINS "Authentication failure"
#
## Example output:
#
#2022-XX-XX XX:XX:XX.851740-0800 XXXXXX Default 0x0 1333 0 SecurityAgent: (loginsupport) [com.apple.loginwindow:Process] Authentication failure type = 3
#
## Additional Information:
#
#Useful for identifying frequent failed user login attempts.
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#No
#
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.