author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'login_through_login_window_with_apple_watch_success'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on a successful login with Apple Watch at the macOS login window.
    This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a successful login with Apple Watch.
id: 503160dc-97c9-4506-b0ab-fd4434c134ce
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        processImagePath|endswith: 'loginwindow'
        eventMessage|contains|all:
            - 'LWScreenLockAuthentication'
            - 'screensaver_aks'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## login_through_login_window_with_apple_watch_success
##
## This Unified Log filter may be used to report on a successful login with Apple Watch at the macOS login window.
## This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a successful login with Apple Watch.
##
## Filter Predicate:
#
#processImagePath ENDSWITH[c] "loginwindow" and eventMessage contains[c] "LWScreenLockAuthentication" and eventMessage contains[c] "screensaver_aks"
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.