author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'login_through_login_window_with_password_success'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on successful login with a password at the macOS login window.
    This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a successful login with the password.

id: 62e3a46d-ee90-4f1a-a67b-f3b9edb4429b
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        processImagePath|startswith: '/System/Library/CoreServices'
        process: 'loginwindow'
        subsystem: 'com.apple.loginwindow.logging'
        eventMessage|contains: '[Login1 doLogin] | shortUsername'
    condition: selection
falsepositives:
    - unknown
references:
   - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## login_through_login_window_with_password_success
##
## This Unified Log filter may be used to report on successful login with a password at the macOS login window.
## This filter functions by monitoring logging from loginwindow process where the event messaging contains a known string indicating a successful login with the password.
##
## Filter Predicate:
#
#processImagePath BEGINSWITH "/System/Library/CoreServices" AND process == "loginwindow" AND subsystem == "com.apple.loginwindow.logging" AND eventMessage CONTAINS "[Login1 doLogin] | shortUsername"
#
## Example output:
#
#2022-XX-XX XX:XX:XX.757619-0800 XXXXXX Default XXX XXXX 0 loginwindow: [com.apple.loginwindow.logging:Standard] -[Login1 doLogin] | shortUsername = username-here, userID = 501, groupID = XX
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#Yes
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.