author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'mdm_profile_manual_removal'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on removal of the MDM Profile off of an endpoint where the action was completed manually, such as via System Preferences or with a 'jamf removeMdmProfile' command.
    This filter functions by monitoring logging from the ManagedClient subsystem where the event messaging contains a known string found when the MDM Profile is removed.
id: 7f582164-1a2e-45f8-b978-1d8339d51735
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        subsystem: 'om.apple.ManagedClient'
        eventMessage|contains|all:
            - 'Removed configuration profile: MDM Profile'
            - 'Source: Manual'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa
## mdm_profile_manual_removal
##
## This Unified Log filter may be used to report on removal of the MDM Profile off of an endpoint where the action was completed manually, such as via System Preferences or with a 'builtin removeMdmProfile' command.
## This filter functions by monitoring logging from the ManagedClient subsystem where the event messaging contains a known string found when the MDM Profile is removed.
##
## Filter Predicate:
#
#subsystem == "com.apple.ManagedClient" AND eventMessage CONTAINS "Removed configuration profile: MDM Profile" AND eventMessage CONTAINS "Source: Manual"
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.