author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'network_server_connection_attempts_outbound'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on network server connection attempts from the Mac endpoint, such as mounting an SMB share or connecting to an FTP server through Finder's Connect to Server service.
    This filter functions by monitoring logging from NetAuthSysAgent, the process used for these connections.
id: 29bad37f-ca46-4372-beae-f9df4f863588
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        process: 'NetAuthSysAgent'
        subsystem: 'com.apple.NetAuthAgent'
        category: 'IPC'
        eventMessage|startswith: 'URL = '
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa
## network_server_connection_attempts_outbound
##
## This Unified Log filter may be used to report on network server connection attempts from the Mac endpoint, such as mounting an SMB share or connecting to an FTP server through Finder's Connect to Server service.
## This filter functions by monitoring logging from NetAuthSysAgent, the process used for these connections.
#
## Filter Predicate(s):
#
#process == "NetAuthSysAgent" AND subsystem == "com.apple.NetAuthAgent" AND category == "IPC" AND eventMessage BEGINSWITH "URL = "
#
## Example output:
#
#2021-XX-XX XX:XX:XX.676891+0000 XXXXXXX Default XXXXXXX XXXX 0 NetAuthSysAgent: (loginsupport) [com.apple.NetAuthAgent:IPC] URL = smb://127.0.0.1
#2021-XX-XX XX:XX:XX.676891+0000 XXXXXXX Default XXXXXXX XXXX 0 NetAuthSysAgent: (loginsupport) [com.apple.NetAuthAgent:IPC] URL = ftp://127.0.0.1
#
## Additional Information:
#
#Log entries will appear from connection attempts rather than completed, successful connections.
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#No
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.