author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'screen_sharing_connections_inbound'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on inbound screen sharing connections to the endpoint made through the native screensharing client on Mac, both successful and failed.
    This filter functions by monitoring logging from the screensharingd process and an event message containing a string known to indicate an inbound authentication event.
id: e143fc28-af65-4faa-828a-6d9e2bcdbb54
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        process: 'screensharingd'
        eventMessage|startswith: 'Authentication: '
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa
## screen_sharing_connections_inbound
##
## This Unified Log filter may be used to report on inbound screen sharing connections to the endpoint made through the native screensharing client on Mac, both successful and failed.
## This filter functions by monitoring logging from the screensharingd process and an event message containing a string known to indicate an inbound authentication event.
#
## Filter Predicate(s):
#
#process == "screensharingd" AND eventMessage BEGINSWITH "Authentication: "
#
## Example output:
#
#2021-XX-XX XX:XX:XX.926947-0800 XXXXXX  Default XXX XXX    0    screensharingd: Authentication: SUCCEEDED :: User Name: <username> :: Viewer Address: <ip-address> :: Type: N/A
#2021-XX-XX XX:XX:XX.807859-0800 XXXXXX  Default XXX XXX    0    screensharingd: Authentication: FAILED :: User Name: N/A :: Viewer Address: <ip-address> :: Type: N/A
#
## Additional Information:
#
#n/a
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#Yes
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.