author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'sudo_access_failed_incorrect_password'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on failed sudo access on the command-line due to three incorrect password attempts.
    This filter functions by monitoring logging from sudo process where the event messaging contains a known string indicating a three failed password attempts.
id: 84579dca-6970-4fc7-8e1b-e3cac99f0d69
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        process: 'sudo'
        eventMessage|contains|all:
            - 'TTY'
            - '3 incorrect password attempts'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## sudo_access_failed_incorrect_password
##
## This Unified Log filter may be used to report on failed sudo access on the command-line due to three incorrect password attempts.
## This filter functions by monitoring logging from sudo process where the event messaging contains a known string indicating a three failed password attempts.
##
## Filter Predicate:
#
#process == "sudo" AND eventMessage CONTAINS[c] "TTY" AND eventMessage CONTAINS[c] "3 incorrect password attempts"
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.