author: 'TODO'
date: 2023/06/19
modified: 2023/06/19

title: 'xprotect_remediator_scan_activity'
details: 'TODO'
description: |
    This Unified Log filter may be used to report on XProtect Remediator scanning activity. 
    This filter functions by monitoring logging from the subsystem, process and category known to be used for log entries from this activity.
id: 7f8c929c-bd4a-4d22-9c19-a1e324bd2214
level: informational
status: experimental
logsource:
    product: macos
detection:
    selection:
        subsystem: 'com.apple.XProtectFramework.PluginAPI'
        category: 'XPEvent.structured'
    condition: selection
falsepositives:
    - unknown
references:
    - https://github.com/builtin/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa
## xprotect_remediator_scan_activity
##
## This Unified Log filter may be used to report on XProtect Remediator scanning activity.
## This filter functions by monitoring logging from the subsystem, process and category known to be used for log entries from this activity.
#
## Filter Predicate(s):
#
#subsystem == "com.apple.XProtectFramework.PluginAPI" && category == "XPEvent.structured"
#
## Example output:
#
#2022-XX-XX XX:XX:XX.887844+0000 XXXXXXX Default 0x0 67929  0    XProtectRemediatorDubRobber: [com.apple.XProtectFramework.PluginAPI:XPEvent.structured] {"caused_by":[],"status_message":"NoThreatDetected","status_code":20,"execution_duration":4.215749979019165}
#2022-XX-XX XX:XX:XX.887844+0000 XXXXXXX Default 0x0 67930  0    XProtectRemediatorDubRobber: [com.apple.XProtectFramework.PluginAPI:XPEvent.structured] {"caused_by":[],"status_message":"NoThreatDetected","status_code":20,"execution_duration":3.4305310249328613}
#2022-XX-XX XX:XX:XX.887844+0000 XXXXXXX Default 0x0 71480  0    XProtectRemediatorEicar: [com.apple.XProtectFramework.PluginAPI:XPEvent.structured] {"caused_by":[],"status_message":"NoThreatDetected","status_code":20,"execution_duration":0.021074056625366211}
#2022-XX-XX XX:XX:XX.887844+0000 XXXXXXX Default 0x0 71480  0    XProtectRemediatorEicar: [com.apple.XProtectFramework.PluginAPI:XPEvent.structured] {"caused_by":[],"status_message":"NoThreatDetected","status_code":20,"execution_duration":0.0098459720611572266}
#2022-XX-XX XX:XX:XX.887844+0000 XXXXXXX Default 0x0 79677  0    XProtectRemediatorDubRobber: [com.apple.XProtectFramework.PluginAPI:XPEvent.structured] {"caused_by":[],"status_message":"NoThreatDetected","status_code":20,"execution_duration":4.135390043258667}
#2022-XX-XX XX:XX:XX.887844+0000 XXXXXXX Default 0x0 79678  0    XProtectRemediatorDubRobber: [com.apple.XProtectFramework.PluginAPI:XPEvent.structured] {"caused_by":[],"status_message":"NoThreatDetected","status_code":20,"execution_duration":3.4207810163497925}
#
## Additional Information:
#https://eclecticlight.co/2022/09/01/hunting-malware-protection-in-the-log/
## Copyright (c) 2022, Jamf Software, LLC. All rights reserved.