author: 'Fukusuke Takahashi'
date: 2023/06/19
modified: 2023/06/19

title: 'gatekeeper_file_apen_rejections_and_user_bypasses'
details: 'TODO'
description: 'TODO'

id: c7eabe8a-f35a-44ce-8392-43ab0e51e961
level: informational
status: experimental
logsource:
  product: macos
detection:
  selection:
    process:"TODO"
  condition: selection
falsepositives:
  - unknown
references:
  - https://github.com/jamf/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa
## gatekeeper_file_apen_rejections_and_user_bypasses
##
## This Unified Log filter may be used to report on events where a user is prevented from accessing a file by double-click, as well as when that user then right-click and chooses to bypass Gatekeeper to open the file anyway.
## This filter functions by monitoring logging containing event messaging with a known string indicating a bypass event occurred.  Please note that the typo in 'sucessfully' is required due to a typo in macOS logging.
##
## Filter Predicate:
#
#subsystem == "com.apple.launchservices" AND process == "CoreServicesUIAgent" AND category == "uiagent" AND (eventMessage BEGINSWITH "Saving rejection record:" OR eventMessage CONTAINS "Gatekeeper rejection record")
#
## Example Output:
#
#2021-XX-XX XX:XX:XX.849161-0800 XXXXXX Default 0x0 597 0 CoreServicesUIAgent: [com.apple.launchservices:uiagent] Saving rejection record:
#Rejected URL=file:///Volumes/VolumeName/PackageName.pkg
#App URL=file:///System/Library/CoreServices/Installer.app/
#2021-XX-XX XX:XX:XX.905569-0800 XXXXXX Default 0x0 597 0 CoreServicesUIAgent: [com.apple.launchservices:uiagent] Cleared Gatekeeper rejection record sucessfully
#
## Additional Information
#
#n/a
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#Yes