author: 'Fukusuke Takahashi'
date: 2023/06/19
modified: 2023/06/19

title: 'root_user_enabled_or_password_changed'
details: 'TODO'
description: 'TODO'

id: a2337f2c-bb41-412e-97d4-1e41379b8127
level: informational
status: experimental
logsource:
  product: macos
detection:
  selection:
    process:"TODO"
  condition: selection
falsepositives:
  - unknown
references:
  - https://github.com/jamf/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa
## root_user_enabled_or_password_changed
##
## This Unified Log filter may be used to report on the root user being enabled or a password change event for a root user already enabled.
## This filter functions by monitoring logging from the opendirectoryd process with a string message known to indicate these events.
##
## Tested macOS Versions:
## - macOS 12
##
## Filter Predicate(s):
#
#processImagePath == "/usr/libexec/opendirectoryd" AND process == "opendirectoryd" AND subsystem == "com.apple.opendirectoryd" AND eventMessage CONTAINS "Password changed for root"
#
## Example output:
#
#2022-XX-XX XX:XX:XX.212488-0800 XXXXXX Default XXXXXXX 318 0 opendirectoryd: (PlistFile) [com.apple.opendirectoryd:auth] Password changed for root (XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX)
#
## Additional Information:
#
## <insert additional information and usage instructions here>
#
## Private Data Expected
## See https://github.com/jamf/jamfprotect/wiki/Unified-Log-Filtering
#
#No