author: 'Fukusuke Takahashi'
date: 2023/06/19
modified: 2023/06/19

title: 'sudo_access_failed_incorrect_password'
details: 'TODO'
description: 'TODO'

id: 84579dca-6970-4fc7-8e1b-e3cac99f0d69
level: informational
status: experimental
logsource:
  product: macos
detection:
  selection:
    process:"TODO"
  condition: selection
falsepositives:
  - unknown
references:
  - https://github.com/jamf/jamfprotect/tree/main/unified_log_filters
ruletype: Hayabusa

## sudo_access_failed_incorrect_password
##
## This Unified Log filter may be used to report on failed sudo access on the command-line due to three incorrect password attempts.
## This filter functions by monitoring logging from sudo process where the event messaging contains a known string indicating a three failed password attempts.
##
## Filter Predicate:
#
#process == "sudo" AND eventMessage CONTAINS[c] "TTY" AND eventMessage CONTAINS[c] "3 incorrect password attempts"